GNU gdb (Ubuntu 7.11.1-0ubuntu1~16.5) 7.11.1
Copyright (C) 2016 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from tools/system...done.
0x0000fff0 in sys_pipe (
    fildes=0x0 <startup_32>) at pipe.c:93
93			current->filp[fd[0]]=NULL;
Breakpoint 1 at 0x67a7: file init/main.c, line 112.
---Type <return> to continue, or q <return>  to quit---

Breakpoint 1, main () at init/main.c:112
112	{			/* The startup routine assumes (well, ...) this */
1: current->pid = 0
(gdb) b 145
Breakpoint 2 at 0x68e8: file init/main.c, line 145.
(gdb) c
Continuing.

Breakpoint 2, main () at init/main.c:145
145		move_to_user_mode();
1: current->pid = 0
(gdb) n
147		if (!fork()) {		/* we count on this going ok */
1: current->pid = 0
(gdb) x/5i $eip
=> 0x6903 <main+348>:	mov    $0x2,%eax
   0x6908 <main+353>:	int    $0x80
   0x690a <main+355>:	
    mov    %eax,-0x1c(%ebp)
   0x690d <main+358>:	
    cmpl   $0x0,-0x1c(%ebp)
   0x6911 <main+362>:	
    js     0x6918 <main+369>
(gdb) si
0x00006908 in fork () at init/main.c:24
24	__always_inline _syscall0(int,fork)
1: current->pid = 0
(gdb) x/5i $eip
=> 0x6908 <main+353>:	int    $0x80
   0x690a <main+355>:	
    mov    %eax,-0x1c(%ebp)
   0x690d <main+358>:	
    cmpl   $0x0,-0x1c(%ebp)
   0x6911 <main+362>:	
    js     0x6918 <main+369>
   0x6913 <main+364>:	
    mov    -0x1c(%ebp),%eax
(gdb) shell ./rundbg
(gdb) q
A debugging session is active.

	Inferior 1 [Remote target] will be killed.

Quit anyway? (y or n) y
